ZigaMahne/STM32U5xx_DFP/CMSIS/SVD/STM32U5F7.svd
          <register>
            <name>JPEG_HUFFENC_AC0_59</name>
            <displayName>JPEG_HUFFENC_AC0_59</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5EC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE118</name>
                <description>Huffman code 118</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN118</name>
                <description>Huffman length 118</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE119</name>
                <description>Huffman code 119</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN119</name>
                <description>Huffman length 119</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_4</name>
            <displayName>JPEG_HUFFENC_AC1_4</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_59</alternateRegister>
            <addressOffset>0x5EC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE8</name>
                <description>Huffman code 8</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN8</name>
                <description>Huffman length 8</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE9</name>
                <description>Huffman code 9</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN9</name>
                <description>Huffman length 9</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_60</name>
            <displayName>JPEG_HUFFENC_AC0_60</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE120</name>
                <description>Huffman code 120</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN120</name>
                <description>Huffman length 120</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE121</name>
                <description>Huffman code 121</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN121</name>
                <description>Huffman length 121</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_5</name>
            <displayName>JPEG_HUFFENC_AC1_5</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_60</alternateRegister>
            <addressOffset>0x5F0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE10</name>
                <description>Huffman code 10</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN10</name>
                <description>Huffman length 10</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE11</name>
                <description>Huffman code 11</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN11</name>
                <description>Huffman length 11</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_61</name>
            <displayName>JPEG_HUFFENC_AC0_61</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5F4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE122</name>
                <description>Huffman code 122</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN122</name>
                <description>Huffman length 122</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE123</name>
                <description>Huffman code 123</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN123</name>
                <description>Huffman length 123</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_6</name>
            <displayName>JPEG_HUFFENC_AC1_6</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_61</alternateRegister>
            <addressOffset>0x5F4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE12</name>
                <description>Huffman code 12</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN12</name>
                <description>Huffman length 12</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE13</name>
                <description>Huffman code 13</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN13</name>
                <description>Huffman length 13</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_62</name>
            <displayName>JPEG_HUFFENC_AC0_62</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5F8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE124</name>
                <description>Huffman code 124</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN124</name>
                <description>Huffman length 124</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE125</name>
                <description>Huffman code 125</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN125</name>
                <description>Huffman length 125</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_7</name>
            <displayName>JPEG_HUFFENC_AC1_7</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_62</alternateRegister>
            <addressOffset>0x5F8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE14</name>
                <description>Huffman code 14</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN14</name>
                <description>Huffman length 14</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE15</name>
                <description>Huffman code 15</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN15</name>
                <description>Huffman length 15</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_63</name>
            <displayName>JPEG_HUFFENC_AC0_63</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x5FC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE126</name>
                <description>Huffman code 126</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN126</name>
                <description>Huffman length 126</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE127</name>
                <description>Huffman code 127</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN127</name>
                <description>Huffman length 127</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_8</name>
            <displayName>JPEG_HUFFENC_AC1_8</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_63</alternateRegister>
            <addressOffset>0x5FC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE16</name>
                <description>Huffman code 16</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN16</name>
                <description>Huffman length 16</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE17</name>
                <description>Huffman code 17</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN17</name>
                <description>Huffman length 17</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_64</name>
            <displayName>JPEG_HUFFENC_AC0_64</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x600</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE128</name>
                <description>Huffman code 128</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN128</name>
                <description>Huffman length 128</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE129</name>
                <description>Huffman code 129</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN129</name>
                <description>Huffman length 129</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_9</name>
            <displayName>JPEG_HUFFENC_AC1_9</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_64</alternateRegister>
            <addressOffset>0x600</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE18</name>
                <description>Huffman code 18</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN18</name>
                <description>Huffman length 18</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE19</name>
                <description>Huffman code 19</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN19</name>
                <description>Huffman length 19</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_65</name>
            <displayName>JPEG_HUFFENC_AC0_65</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x604</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE130</name>
                <description>Huffman code 130</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN130</name>
                <description>Huffman length 130</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE131</name>
                <description>Huffman code 131</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN131</name>
                <description>Huffman length 131</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC1_10</name>
            <displayName>JPEG_HUFFENC_AC1_10</displayName>
            <description>JPEG Huffman encoder AC1</description>
			<alternateRegister>JPEG_HUFFENC_AC0_65</alternateRegister>
            <addressOffset>0x604</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE20</name>
                <description>Huffman code 20</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN20</name>
                <description>Huffman length 20</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE21</name>
                <description>Huffman code 21</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN21</name>
                <description>Huffman length 21</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>JPEG_HUFFENC_AC0_66</name>
            <displayName>JPEG_HUFFENC_AC0_66</displayName>
            <description>JPEG Huffman encoder AC0</description>
            <addressOffset>0x608</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>HCODE132</name>
                <description>Huffman code 132</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN132</name>
                <description>Huffman length 132</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HCODE133</name>
                <description>Huffman code 133</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>HLEN133</name>
                <description>Huffman length 133</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
